{
  "backend/main.mo": "Defines a Submission type, stores submissions in a List, and provides functions to submit and retrieve contact form entries.",
  "feature_evidence.json": "Feature evidence report linking a resume-download requirement to the HomeSection component and related metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files including sections, hooks, components, and assets.",
  "frontend/index.css": "Global Tailwind-based styling defining light and dark theme color variables and base element styling.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and loading the main React script.",
  "frontend/src/App.tsx": "Main React app wiring providers and rendering all portfolio sections with navigation and footer.",
  "frontend/src/components/Footer.tsx": "Renders the footer with dynamic year, branding, and a caffeine.ai referral link.",
  "frontend/src/components/Reveal.tsx": "Animation wrapper that reveals children on scroll using IntersectionObserver.",
  "frontend/src/components/Section.tsx": "Layout component providing a styled section wrapper with container spacing.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with bio text, career goal, strengths, and tools using reveal animations.",
  "frontend/src/components/sections/AchievementsSection.tsx": "Displays key achievements in a grid with icons and animated reveal effects.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form component with validation and mutation submission plus static contact info links.",
  "frontend/src/components/sections/EducationSection.tsx": "Renders a list of education entries with icons and reveal animations.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Displays an internship role with a list of achievements using animated reveal.",
  "frontend/src/components/sections/HomeSection.tsx": "Hero section with name, summary, and buttons for navigation and resume download.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows multiple analytics projects with descriptions, tools, and outcomes.",
  "frontend/src/components/sections/SkillsSection.tsx": "Displays skills with icons and animated proficiency bars.",
  "frontend/src/components/TopNav.tsx": "Sticky responsive navbar with smooth scrolling, active section tracking, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation for submitting the contact form via the backend actor and invalidates submissions cache.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Custom hook using IntersectionObserver to detect when an element becomes visible and expose a ref and visibility flag.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH theme variables for light/dark modes and utility extensions.",
  "frontend/src/main.tsx": "Application entry that sets up React root, React Query provider, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors from CSS variables, typography/plugins, and extended animations.",
  "project_state.json": "Project state metadata describing portfolio requirements, design notes, issues, and implemented features."
}